#language:ru

Функциональность:  поиск самых дооргих принтеров во Владивостоке

  Сценарий:

    Дано открыта страница Avito
    И в выпадающем списке категорий выбрана <оргтехника>
    И в поле поиска введено "Принтер"
    Тогда кликнуть по выпадающему списку региона
    Тогда значение "Владивосток" введено в поле поиска региона
    Тогда нажата кнопка показать найденные объявления
    Тогда страница с результатами поиска открыта
    И чекбок только с фото установлен
    Тогда значение ДОРОЖЕ выбрано из выпадающего сортировочного списка
    И значение названия и цены товара выведено в консоль для первых трёх объявлений





